In [1]:
import pandas as pd
import numpy as np

### Series

In [3]:
a1=pd.Series([11,21,31,22,13])
a1

0    11
1    21
2    31
3    22
4    13
dtype: int64

In [5]:
#adding the index
a2=pd.Series([34,21,32,11,23],index=["a","b","c","d","e"])
a2

a    34
b    21
c    32
d    11
e    23
dtype: int64

In [6]:
a2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [7]:
a2["c"]

32

In [8]:
a2[["c","d","a"]]

c    32
d    11
a    34
dtype: int64

In [9]:
a2["a":"c"]

a    34
b    21
c    32
dtype: int64

In [12]:
#creating the series using dict
d1={"name":"nidhisha","age":23,"gender":"f","caste":"jain"}
a3=pd.Series(d1)
a3

name      nidhisha
age             23
gender           f
caste         jain
dtype: object

In [14]:
a3.index.name="details"

In [15]:
a3

details
name      nidhisha
age             23
gender           f
caste         jain
dtype: object

In [5]:
#creating the series from tuple
t1=(3,2,1,4,2,3)
a4=pd.Series(t1,index=("a","b","c","d","e","f"))
a4

a    3
b    2
c    1
d    4
e    2
f    3
dtype: int64

In [32]:
ID=list(range(11,31))
SL=[5.1,4,9,4.7,6.0,4.0,3.6,5.2,5.3,5.7,4.7,3.9,4.0,3.8,4.1,4.9,5.9,4.3,5.4,3.5]
PL = [5.0,4,3,3.7,4.6,7.1,4.5,5.4,5.1,2.7,3.2,3.1,3.2,3.7,5.3,3.8,5.9,4.3,5.4,7.1]
species = ["Iris verginica","iris setosa","Iris verginica","iris vercicolor","iris setosa","iris setosa","iris setosa",
"iris vercicolor","iris vercicolor","Iris verginica","Iris verginica","iris setosa",
"iris setosa","Iris verginica",
"iris vercicolor","iris vercicolor","iris vercicolor","Iris verginica","Iris verginica","iris setosa"]

iris=pd.Series({"id":ID,"sl":SL,"pl":PL,"species":species})
print(iris)

id         [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 2...
sl         [5.1, 4, 9, 4.7, 6.0, 4.0, 3.6, 5.2, 5.3, 5.7,...
pl         [5.0, 4, 3, 3.7, 4.6, 7.1, 4.5, 5.4, 5.1, 2.7,...
species    [Iris verginica, iris setosa, Iris verginica, ...
dtype: object

### Dataframe

In [33]:
#convert above series into data frame
df=pd.DataFrame(dict(iris)).reset_index()
df

    index  id   sl   pl          species
0       0  11  5.1  5.0   Iris verginica
1       1  12  4.0  4.0      iris setosa
2       2  13  9.0  3.0   Iris verginica
3       3  14  4.7  3.7  iris vercicolor
4       4  15  6.0  4.6      iris setosa
5       5  16  4.0  7.1      iris setosa
6       6  17  3.6  4.5      iris setosa
7       7  18  5.2  5.4  iris vercicolor
8       8  19  5.3  5.1  iris vercicolor
9       9  20  5.7  2.7   Iris verginica
10     10  21  4.7  3.2   Iris verginica
11     11  22  3.9  3.1      iris setosa
12     12  23  4.0  3.2      iris setosa
13     13  24  3.8  3.7   Iris verginica
14     14  25  4.1  5.3  iris vercicolor
15     15  26  4.9  3.8  iris vercicolor
16     16  27  5.9  5.9  iris vercicolor
17     17  28  4.3  4.3   Iris verginica
18     18  29  5.4  5.4   Iris verginica
19     19  30  3.5  7.1      iris setosa

In [41]:
df=pd.DataFrame(dict(iris),columns=["pl","sl","species"],index=iris["id"])
df.head(5)

     pl   sl          species
11  5.0  5.1   Iris verginica
12  4.0  4.0      iris setosa
13  3.0  9.0   Iris verginica
14  3.7  4.7  iris vercicolor
15  4.6  6.0      iris setosa

In [42]:
df["species"]

11     Iris verginica
12        iris setosa
13     Iris verginica
14    iris vercicolor
15        iris setosa
16        iris setosa
17        iris setosa
18    iris vercicolor
19    iris vercicolor
20     Iris verginica
21     Iris verginica
22        iris setosa
23        iris setosa
24     Iris verginica
25    iris vercicolor
26    iris vercicolor
27    iris vercicolor
28     Iris verginica
29     Iris verginica
30        iris setosa
Name: species, dtype: object

In [43]:
df.species

11     Iris verginica
12        iris setosa
13     Iris verginica
14    iris vercicolor
15        iris setosa
16        iris setosa
17        iris setosa
18    iris vercicolor
19    iris vercicolor
20     Iris verginica
21     Iris verginica
22        iris setosa
23        iris setosa
24     Iris verginica
25    iris vercicolor
26    iris vercicolor
27    iris vercicolor
28     Iris verginica
29     Iris verginica
30        iris setosa
Name: species, dtype: object

In [73]:
#want to retrive a row
#can call by index using loc
df.loc[23]

pl                 3.2
sl                 4.0
species    iris setosa
count             12.0
Name: 23, dtype: object

In [74]:
df.head(3)

     pl   sl         species  count
11  5.0  5.1  Iris verginica    0.0
12  4.0  4.0     iris setosa    1.0
13  3.0  9.0  Iris verginica    2.0

In [75]:
df["count"]=np.arange(20.0)
df

     pl   sl          species  count
11  5.0  5.1   Iris verginica    0.0
12  4.0  4.0      iris setosa    1.0
13  3.0  9.0   Iris verginica    2.0
14  3.7  4.7  iris vercicolor    3.0
15  4.6  6.0      iris setosa    4.0
16  7.1  4.0      iris setosa    5.0
17  4.5  3.6      iris setosa    6.0
18  5.4  5.2  iris vercicolor    7.0
19  5.1  5.3  iris vercicolor    8.0
20  2.7  5.7   Iris verginica    9.0
21  3.2  4.7   Iris verginica   10.0
22  3.1  3.9      iris setosa   11.0
23  3.2  4.0      iris setosa   12.0
24  3.7  3.8   Iris verginica   13.0
25  5.3  4.1  iris vercicolor   14.0
26  3.8  4.9  iris vercicolor   15.0
27  5.9  5.9  iris vercicolor   16.0
28  4.3  4.3   Iris verginica   17.0
29  5.4  5.4   Iris verginica   18.0
30  7.1  3.5      iris setosa   19.0

In [76]:
#then you are assigning lists or arrays to a column, the value’s length must match the
#length of the DataFrame. If you assign a Series, its labels will be realigned exactly to
#the DataFrame’s index, inserting missing values in any holes:
df["other"]=pd.Series(["sidhi",3,4],index=[18,23,14])

In [77]:
df

     pl   sl          species  count  other
11  5.0  5.1   Iris verginica    0.0    NaN
12  4.0  4.0      iris setosa    1.0    NaN
13  3.0  9.0   Iris verginica    2.0    NaN
14  3.7  4.7  iris vercicolor    3.0      4
15  4.6  6.0      iris setosa    4.0    NaN
16  7.1  4.0      iris setosa    5.0    NaN
17  4.5  3.6      iris setosa    6.0    NaN
18  5.4  5.2  iris vercicolor    7.0  sidhi
19  5.1  5.3  iris vercicolor    8.0    NaN
20  2.7  5.7   Iris verginica    9.0    NaN
21  3.2  4.7   Iris verginica   10.0    NaN
22  3.1  3.9      iris setosa   11.0    NaN
23  3.2  4.0      iris setosa   12.0      3
24  3.7  3.8   Iris verginica   13.0    NaN
25  5.3  4.1  iris vercicolor   14.0    NaN
26  3.8  4.9  iris vercicolor   15.0    NaN
27  5.9  5.9  iris vercicolor   16.0    NaN
28  4.3  4.3   Iris verginica   17.0    NaN
29  5.4  5.4   Iris verginica   18.0    NaN
30  7.1  3.5      iris setosa   19.0    NaN

In [80]:
#want to delete the column other
del df["other"]

In [81]:
df.head(2)

     pl   sl         species  count
11  5.0  5.1  Iris verginica    0.0
12  4.0  4.0     iris setosa    1.0

In [84]:
#nested dict
pop={"India":{2000:30,2005:90,2010:110},
    "USA":{2000:10,2005:50},
    "UK":{2000:5,2005:40,2010:90}}   #outer key values in considered as columns and inner key is row indices
df1=pd.DataFrame(pop)
df1

      India   USA  UK
2000     30  10.0   5
2005     90  50.0  40
2010    110   NaN  90

In [85]:
df1.T

       2000  2005   2010
India  30.0  90.0  110.0
USA    10.0  50.0    NaN
UK      5.0  40.0   90.0

In [91]:
#providing the column name and row name
df1.index.name="year"
df1.columns.name="country"

In [92]:
df1

country  India   USA  UK
year
2000        30  10.0   5
2005        90  50.0  40
2010       110   NaN  90

### Index objects

In [95]:
labels=pd.Index(np.arange(4))
s1=pd.Series(["a","b","c","d"],index=labels)
s1

0    a
1    b
2    c
3    d
dtype: object

In [97]:
labels=pd.Index(["a","a","b","a"])
s2=pd.Series(np.arange(4),index=labels)
s2

a    0
a    1
b    2
a    3
dtype: int32

In [98]:
s2["a"]

a    0
a    1
a    3
dtype: int32

### reindex

In [99]:
obj=pd.Series(np.arange(4),index=["c","b","a","d"])
obj

c    0
b    1
a    2
d    3
dtype: int32

In [100]:
#reindex row
obj2=obj.reindex(["a","b","c","d","e"])

In [101]:
obj2

a    2.0
b    1.0
c    0.0
d    3.0
e    NaN
dtype: float64

In [112]:
#like wise can change the column also
df=pd.DataFrame(np.arange(16).reshape(4,4),index=["a","c","d","e"],columns=["India","pakisthan","shrilanka","USA"])
df

   India  pakisthan  shrilanka  USA
a      0          1          2    3
c      4          5          6    7
d      8          9         10   11
e     12         13         14   15

In [115]:
df1=df.reindex(index=["a","b","c","d","e"],columns=["India","UK","shrilanka","USA"])
df1

   India  UK  shrilanka   USA
a    0.0 NaN        2.0   3.0
b    NaN NaN        NaN   NaN
c    4.0 NaN        6.0   7.0
d    8.0 NaN       10.0  11.0
e   12.0 NaN       14.0  15.0

In [118]:
df2=df.loc[["a","c","d","e"]]
df2

   India  pakisthan  shrilanka  USA
a      0          1          2    3
c      4          5          6    7
d      8          9         10   11
e     12         13         14   15

### droping the entries

In [121]:
s1=pd.Series(np.arange(4),index=["a","b","c","d"])
s1

a    0
b    1
c    2
d    3
dtype: int32

In [125]:
s2=s1.drop("c")
s2

a    0
b    1
d    3
dtype: int32

In [127]:
s3=s1.drop(["c","d"])
s3

a    0
b    1
dtype: int32

In [128]:
df=pd.DataFrame(np.arange(16).reshape(4,4),index=["a","b","c","d"], columns=["India","UK","shrilanka","USA"])
df

   India  UK  shrilanka  USA
a      0   1          2    3
b      4   5          6    7
c      8   9         10   11
d     12  13         14   15

In [135]:
#droping the single column
droped_df=df.drop(columns=["shrilanka"])
droped_df

   India  UK  USA
a      0   1    3
b      4   5    7
c      8   9   11
d     12  13   15

In [137]:
# droping the multiple column
drop_df=df.drop(columns=["USA","UK"])
drop_df

   India  shrilanka
a      0          2
b      4          6
c      8         10
d     12         14

In [139]:
#drop the multiplr row
drop_rows=df.drop(index=["a","c"])
drop_rows

   India  UK  shrilanka  USA
b      4   5          6    7
d     12  13         14   15

In [140]:
# by using the axis
drop_row=df.drop(["c","a"],axis=0)
drop_row

   India  UK  shrilanka  USA
b      4   5          6    7
d     12  13         14   15

In [141]:
drop_col=df.drop(["USA"],axis=1)
drop_col

   India  UK  shrilanka
a      0   1          2
b      4   5          6
c      8   9         10
d     12  13         14

### indexing,selection and filtering

In [9]:
df=pd.Series(np.arange(5),index=["a","b","c","d","e"])
df

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [10]:
df["a"]

0

In [11]:
df[["a","c","d"]]

a    0
c    2
d    3
dtype: int32

In [12]:
df[2:4]

c    2
d    3
dtype: int32

In [13]:
df[df<3]

a    0
b    1
c    2
dtype: int32

### dataframe of indexing,slicing,boolean

In [100]:
df=pd.DataFrame(np.arange(16).reshape(4,4),index=["a","b","c","d"],columns=["india","uk",'usa','germany'])
df

   india  uk  usa  germany
a      0   1    2        3
b      4   5    6        7
c      8   9   10       11
d     12  13   14       15

In [3]:
df["india"]

a     0
b     4
c     8
d    12
Name: india, dtype: int32

In [4]:
df[["uk","usa"]]

   uk  usa
a   1    2
b   5    6
c   9   10
d  13   14

In [5]:
df[:3]

   india  uk  usa  germany
a      0   1    2        3
b      4   5    6        7
c      8   9   10       11

In [6]:
df[df["uk"]>2]["uk"]

b     5
c     9
d    13
Name: uk, dtype: int32

In [7]:
df[2:4]

   india  uk  usa  germany
c      8   9   10       11
d     12  13   14       15

## loc and iloc
loc and iloc. They enable you to select a subset of the rows and columns from a
DataFrame with NumPy-like notation using either axis labels (loc) or integers
(iloc)

In [8]:
df.loc["a",["uk","usa"]]

uk     1
usa    2
Name: a, dtype: int32

In [9]:
df.iloc[0,[1,2]]

uk     1
usa    2
Name: a, dtype: int32

In [10]:
df.loc["a":"c",["india"]]   #last mentioned index is inclusive

   india
a      0
b      4
c      8

In [11]:
df.iloc[0:3,0]

a    0
b    4
c    8
Name: india, dtype: int32

In [12]:
df

   india  uk  usa  germany
a      0   1    2        3
b      4   5    6        7
c      8   9   10       11
d     12  13   14       15

In [13]:
#want to return the rows having greater than 3 but last 3 columns value
df.iloc[:,-3:][df.germany>5]

   uk  usa  germany
b   5    6        7
c   9   10       11
d  13   14       15

### Arithmetic and data alignment

In [14]:
s1=pd.Series(np.arange(1,6),index=list("adcef"))
print(s1)
s2=pd.Series(np.arange(11,16),index=list("abcdg"))
print(s2)

a    1
d    2
c    3
e    4
f    5
dtype: int32
a    11
b    12
c    13
d    14
g    15
dtype: int32

In [15]:
add=s1+s2
add

a    12.0
b     NaN
c    16.0
d    16.0
e     NaN
f     NaN
g     NaN
dtype: float64

In [16]:
df1=pd.DataFrame(np.random.randint(11,30,(9,5)),index=list("abcdfghij"),columns=["ind","kor","jan","ger","aut"])
print(df1.head(2))
df2=pd.DataFrame(np.random.randint(41,80,(9,5)),index=list("acdefghij"),columns=["ind","kor","jan","uk","aut"])
print(df2.head(2))

   ind  kor  jan  ger  aut
a   26   21   16   22   26
b   17   23   16   13   25
   ind  kor  jan  uk  aut
a   53   66   43  65   57
c   49   66   61  57   68

In [17]:
add=df1+df2
add              #adding the two dataframe by union method

     aut  ger   ind   jan   kor  uk
a   83.0  NaN  79.0  59.0  87.0 NaN
b    NaN  NaN   NaN   NaN   NaN NaN
c   90.0  NaN  67.0  83.0  94.0 NaN
d   80.0  NaN  87.0  83.0  96.0 NaN
e    NaN  NaN   NaN   NaN   NaN NaN
f   85.0  NaN  84.0  80.0  86.0 NaN
g   67.0  NaN  81.0  94.0  97.0 NaN
h   93.0  NaN  66.0  96.0  56.0 NaN
i  100.0  NaN  81.0  67.0  70.0 NaN
j   70.0  NaN  87.0  79.0  84.0 NaN

In [18]:
df1.add(df2,fill_value=0)

     aut   ger   ind   jan   kor    uk
a   83.0  22.0  79.0  59.0  87.0  65.0
b   25.0  13.0  17.0  16.0  23.0   NaN
c   90.0  15.0  67.0  83.0  94.0  57.0
d   80.0  11.0  87.0  83.0  96.0  68.0
e   47.0   NaN  50.0  72.0  53.0  71.0
f   85.0  22.0  84.0  80.0  86.0  72.0
g   67.0  27.0  81.0  94.0  97.0  55.0
h   93.0  29.0  66.0  96.0  56.0  52.0
i  100.0  12.0  81.0  67.0  70.0  55.0
j   70.0  26.0  87.0  79.0  84.0  52.0

In [19]:
df1=pd.DataFrame(np.arange(12).reshape(4,3))
df1

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [20]:
df2=df1.iloc[0,:]
df2

0    0
1    1
2    2
Name: 0, dtype: int32

In [21]:
sub=df1-df2
sub

   0  1  2
0  0  0  0
1  3  3  3
2  6  6  6
3  9  9  9

In [22]:
#If an index value is not found in either the DataFrame’s columns or the Series’s index,
#the objects will be reindexed to form the union

In [23]:
df1=pd.DataFrame(np.arange(12).reshape(4,3))
df1

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [24]:
df2=df1[0]

In [25]:
sub=df1-df2
sub

   0  1  2   3
0  0 -2 -4 NaN
1  3  1 -1 NaN
2  6  4  2 NaN
3  9  7  5 NaN

In [26]:
df1=pd.DataFrame(np.arange(12).reshape(4,3))
df2=df1[0]
df1.sub(df2,axis=0)  # based on index means in both df finds the same index

   0  1  2
0  0  1  2
1  0  1  2
2  0  1  2
3  0  1  2

In [27]:
f=lambda x:x.max()-x.min()

In [28]:
df

   india  uk  usa  germany
a      0   1    2        3
b      4   5    6        7
c      8   9   10       11
d     12  13   14       15

In [29]:
df.apply(f)

india      12
uk         12
usa        12
germany    12
dtype: int64

In [30]:
def square(x):
    return x**2

In [31]:
df["square_uk"]=df["uk"].apply(square)

In [32]:
df

   india  uk  usa  germany  square_uk
a      0   1    2        3          1
b      4   5    6        7         25
c      8   9   10       11         81
d     12  13   14       15        169

In [33]:
df1=df.drop(columns=["square_uk"])

In [49]:
sample=df1.copy()

In [50]:
#want to create a data which contain max and min valueof sample of each column

In [51]:
def sample_list(x):
    return pd.Series([x.max(),x.min()],index=["max","min"])

In [52]:
max_min=sample.apply(sample_list)
max_min

     india  uk  usa  germany
max     12  13   14       15
min      0   1    2        3

In [53]:
f=lambda x: "%.2f" % x

In [56]:
df=df.applymap(f)
df

   india     uk    usa germany
a   0.00   1.00   2.00    3.00
b   4.00   5.00   6.00    7.00
c   8.00   9.00  10.00   11.00
d  12.00  13.00  14.00   15.00

### sorting and ranking

In [64]:
s1=pd.Series(np.array([4,3,8,6,1]),index=["d","a","e",'b',"c"])
s1

d    4
a    3
e    8
b    6
c    1
dtype: int32

In [65]:
s1.sort_index()         #sort the index based on that index value will sort

a    3
b    6
c    1
d    4
e    8
dtype: int32

In [70]:
sorted_df=df.sort_index()   #it will sort an index based on axis=0
sorted_df

   india     uk    usa germany
a   0.00   1.00   2.00    3.00
b   4.00   5.00   6.00    7.00
c   8.00   9.00  10.00   11.00
d  12.00  13.00  14.00   15.00

In [72]:
#want to sort the column
sorted_df=df.sort_index(axis=1)
sorted_df

  germany  india     uk    usa
a    3.00   0.00   1.00   2.00
b    7.00   4.00   5.00   6.00
c   11.00   8.00   9.00  10.00
d   15.00  12.00  13.00  14.00

In [74]:
#want to sort in the decending order
sorted_df=df.sort_index()[::-1]
sorted_df

   india     uk    usa germany
d  12.00  13.00  14.00   15.00
c   8.00   9.00  10.00   11.00
b   4.00   5.00   6.00    7.00
a   0.00   1.00   2.00    3.00

In [75]:
sorted_df=df.sort_index(ascending=False)
sorted_df

   india     uk    usa germany
d  12.00  13.00  14.00   15.00
c   8.00   9.00  10.00   11.00
b   4.00   5.00   6.00    7.00
a   0.00   1.00   2.00    3.00

In [76]:
sorted_df=df.sort_index(axis=1,ascending=False)
sorted_df

     usa     uk  india germany
a   2.00   1.00   0.00    3.00
b   6.00   5.00   4.00    7.00
c  10.00   9.00   8.00   11.00
d  14.00  13.00  12.00   15.00

In [ ]:
#if contains any missing value, it will be sorted in the last.

In [101]:
#sort the values
df=pd.DataFrame(np.random.randint(10,50,(6,6)),index=list("abcdef"),columns=["ind","uk","usa",'pak',"ger","kor"])
df

   ind  uk  usa  pak  ger  kor
a   10  14   45   36   16   10
b   18  20   31   23   17   11
c   17  37   30   32   33   17
d   26  29   24   22   46   13
e   20  37   11   45   23   44
f   46  45   39   22   12   15

In [82]:
df.sort_values(by="ind")   # only sort the value by columns wise

   ind  uk  usa  pak  ger  kor
d   15  43   19   25   47   45
c   23  23   38   42   47   13
e   24  14   16   17   43   41
f   25  18   24   26   31   38
b   39  11   27   26   23   28
a   43  38   14   14   10   47

In [84]:
df.sort_values(by=["pak","ger"])

   ind  uk  usa  pak  ger  kor
a   43  38   14   14   10   47
e   24  14   16   17   43   41
d   15  43   19   25   47   45
b   39  11   27   26   23   28
f   25  18   24   26   31   38
c   23  23   38   42   47   13

In [90]:
# rank

In [88]:
rank_series=s1.rank()
rank_series

d    3.0
a    2.0
e    5.0
b    4.0
c    1.0
dtype: float64

In [91]:
s1["f"]=4
s1

d    4
a    3
e    8
b    6
c    1
f    4
dtype: int64

In [92]:
rank_series=s1.rank()       #it assign the mean for tie values
rank_series

d    3.5
a    2.0
e    6.0
b    5.0
c    1.0
f    3.5
dtype: float64

In [93]:
#want to assign the max for an tie value
rank_s1=s1.rank(method='max')
rank_s1

d    4.0
a    2.0
e    6.0
b    5.0
c    1.0
f    4.0
dtype: float64

In [95]:
#want to assign the rank in decsending order
rank_s1=s1.rank(method='average',ascending=False)
rank_s1

d    3.5
a    5.0
e    1.0
b    2.0
c    6.0
f    3.5
dtype: float64

In [110]:
df

   ind  uk  usa  pak  ger  kor
a   10  14   45   36   16   10
b   18  20   31   23   17   11
c   17  37   30   32   33   17
d   26  29   24   22   46   13
e   20  37   11   45   23   44
f   46  45   39   22   12   15

In [111]:
df_rank=df.rank()
df_rank

   ind   uk  usa  pak  ger  kor
a  1.0  1.0  6.0  5.0  2.0  1.0
b  3.0  2.0  4.0  3.0  3.0  2.0
c  2.0  4.5  3.0  4.0  5.0  5.0
d  5.0  3.0  2.0  1.5  6.0  3.0
e  4.0  4.5  1.0  6.0  4.0  6.0
f  6.0  6.0  5.0  1.5  1.0  4.0

In [112]:
df_rank=df.rank(axis=1)
df_rank

   ind   uk  usa  pak  ger  kor
a  1.5  3.0  6.0  5.0  4.0  1.5
b  3.0  4.0  6.0  5.0  2.0  1.0
c  1.5  6.0  3.0  4.0  5.0  1.5
d  4.0  5.0  3.0  2.0  6.0  1.0
e  2.0  4.0  1.0  6.0  3.0  5.0
f  6.0  5.0  4.0  3.0  1.0  2.0

### axis indexes and duplicates lables

In [114]:
s2=pd.Series(np.arange(6),index=["a","a","b","b","c","d"])
s2

a    0
a    1
b    2
b    3
c    4
d    5
dtype: int32

In [118]:
s2.index.is_unique

False

In [122]:
df2=pd.DataFrame(np.arange(12).reshape(4,3),index=["a","a","b","b"])
df2

   0   1   2
a  0   1   2
a  3   4   5
b  6   7   8
b  9  10  11

In [123]:
df2.index.is_unique

False

In [129]:
df2.loc["b"]

   0   1   2
b  6   7   8
b  9  10  11

In [130]:
df

   ind  uk  usa  pak  ger  kor
a   10  14   45   36   16   10
b   18  20   31   23   17   11
c   17  37   30   32   33   17
d   26  29   24   22   46   13
e   20  37   11   45   23   44
f   46  45   39   22   12   15

### mathematical and statistical methods

In [133]:
df

   ind  uk  usa  pak  ger  kor
a   10  14   45   36   16   10
b   18  20   31   23   17   11
c   17  37   30   32   33   17
d   26  29   24   22   46   13
e   20  37   11   45   23   44
f   46  45   39   22   12   15

In [132]:
df["ind"].corr(df["uk"])

0.7396706630864726

In [134]:
df["uk"].cov(df["usa"])

-48.400000000000006

In [135]:
df.cov()

            ind          uk    usa   pak    ger         kor
ind  155.366667  107.466667    9.2 -61.6  -24.3   -3.333333
uk   107.466667  135.866667  -48.4  -3.8   10.2   66.466667
usa    9.200000  -48.400000  140.8 -45.2  -69.6 -123.600000
pak  -61.600000   -3.800000  -45.2  88.4  -15.2   90.600000
ger  -24.300000   10.200000  -69.6 -15.2  164.3    0.600000
kor   -3.333333   66.466667 -123.6  90.6    0.6  164.666667

In [147]:
df["ind"].unique()

array([10, 18, 17, 26, 20, 46])

In [151]:
pd.value_counts(df.values,sort=False)

TypeError: No matching signature found

In [152]:
d1={"id":np.arange(10),"data":[12,43,1,2,1,21,21,2,1,6]}
s1=pd.Series(d1)
s1

id          [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
data    [12, 43, 1, 2, 1, 21, 21, 2, 1, 6]
dtype: object

In [153]:
df1=pd.DataFrame(dict(s1))
df1

   id  data
0   0    12
1   1    43
2   2     1
3   3     2
4   4     1
5   5    21
6   6    21
7   7     2
8   8     1
9   9     6

In [56]:
df=pd.DataFrame(np.random.randint(10,50,(9,5)),index=list("abcdefghi"),columns=list("ABCDE"))
df

    A   B   C   D   E
a  42  17  13  40  34
b  14  37  42  15  25
c  21  46  44  21  35
d  34  11  28  14  12
e  20  25  41  33  34
f  19  33  23  22  45
g  11  37  33  39  29
h  42  23  31  46  25
i  43  15  44  35  45

In [57]:
#remane the columns
df=df.rename(columns={"A":"uk","B":"usa","C":"ind","D":"kor","E":"jan"})
df

   uk  usa  ind  kor  jan
a  42   17   13   40   34
b  14   37   42   15   25
c  21   46   44   21   35
d  34   11   28   14   12
e  20   25   41   33   34
f  19   33   23   22   45
g  11   37   33   39   29
h  42   23   31   46   25
i  43   15   44   35   45

In [58]:
df["kor"]

a    40
b    15
c    21
d    14
e    33
f    22
g    39
h    46
i    35
Name: kor, dtype: int32

In [59]:
df.loc[["a","c","h"],["uk","usa"]]

   uk  usa
a  42   17
c  21   46
h  42   23

In [60]:
df.loc["a":"d",["usa","ind"]]

   usa  ind
a   17   13
b   37   42
c   46   44
d   11   28

In [61]:
df["usa"][:4]

a    17
b    37
c    46
d    11
Name: usa, dtype: int32

In [62]:
df[:4]["usa"]

a    17
b    37
c    46
d    11
Name: usa, dtype: int32

In [63]:
import numpy as np
import pandas as pd

##  Data preparation and cleaning

In [64]:
s1=pd.Series([12,np.nan,23,45,np.nan])
s1

0    12.0
1     NaN
2    23.0
3    45.0
4     NaN
dtype: float64

In [65]:
s2=s1.dropna()

In [66]:
df=pd.DataFrame(np.random.randint(10,40,(6,6)),columns=list("abcdef"))
df.loc[2,"c"]=np.nan
df.loc[3,"a"]=np.nan
df.loc[2,"d"]=np.nan
df.loc[4,"a"]=np.nan

In [67]:
df_copy=df.copy()
df

      a   b     c     d   e   f
0  12.0  16  26.0  21.0  12  20
1  39.0  19  17.0  33.0  30  10
2  26.0  21   NaN   NaN  31  25
3   NaN  10  34.0  30.0  29  36
4   NaN  37  13.0  24.0  20  37
5  39.0  29  27.0  23.0  21  28

In [68]:
a=df_copy.dropna()
a

      a   b     c     d   e   f
0  12.0  16  26.0  21.0  12  20
1  39.0  19  17.0  33.0  30  10
5  39.0  29  27.0  23.0  21  28

In [69]:
df_copy.dropna(axis=1)

    b   e   f
0  16  12  20
1  19  30  10
2  21  31  25
3  10  29  36
4  37  20  37
5  29  21  28

In [70]:
#Passing how='all' will only drop rows that are all NA
df_copy.dropna(how="all")

      a   b     c     d   e   f
0  12.0  16  26.0  21.0  12  20
1  39.0  19  17.0  33.0  30  10
2  26.0  21   NaN   NaN  31  25
3   NaN  10  34.0  30.0  29  36
4   NaN  37  13.0  24.0  20  37
5  39.0  29  27.0  23.0  21  28

In [71]:
#to drop the column if all the values are na
df_copy.dropna(axis=1,how="all")

      a   b     c     d   e   f
0  12.0  16  26.0  21.0  12  20
1  39.0  19  17.0  33.0  30  10
2  26.0  21   NaN   NaN  31  25
3   NaN  10  34.0  30.0  29  36
4   NaN  37  13.0  24.0  20  37
5  39.0  29  27.0  23.0  21  28

In [72]:
df_copy.loc[2,"e":]=np.nan

In [73]:
#want to drop the row or all if contains a perticular number of missing values
#use thresh
df_copy.dropna(thresh=4)  #if any row contain two na values that row will be droped

      a   b     c     d     e     f
0  12.0  16  26.0  21.0  12.0  20.0
1  39.0  19  17.0  33.0  30.0  10.0
3   NaN  10  34.0  30.0  29.0  36.0
4   NaN  37  13.0  24.0  20.0  37.0
5  39.0  29  27.0  23.0  21.0  28.0

### fiilng the missing value

In [74]:
df_copy

      a   b     c     d     e     f
0  12.0  16  26.0  21.0  12.0  20.0
1  39.0  19  17.0  33.0  30.0  10.0
2  26.0  21   NaN   NaN   NaN   NaN
3   NaN  10  34.0  30.0  29.0  36.0
4   NaN  37  13.0  24.0  20.0  37.0
5  39.0  29  27.0  23.0  21.0  28.0

In [75]:
fill_na=df_copy.fillna({"a":12,"c":23,"d":45,"e":10})
fill_na

      a   b     c     d     e     f
0  12.0  16  26.0  21.0  12.0  20.0
1  39.0  19  17.0  33.0  30.0  10.0
2  26.0  21  23.0  45.0  10.0   NaN
3  12.0  10  34.0  30.0  29.0  36.0
4  12.0  37  13.0  24.0  20.0  37.0
5  39.0  29  27.0  23.0  21.0  28.0

In [76]:
fill_na["f"].fillna(fill_na["f"].mean(),inplace=True)

In [77]:
fill_na

      a   b     c     d     e     f
0  12.0  16  26.0  21.0  12.0  20.0
1  39.0  19  17.0  33.0  30.0  10.0
2  26.0  21  23.0  45.0  10.0  26.2
3  12.0  10  34.0  30.0  29.0  36.0
4  12.0  37  13.0  24.0  20.0  37.0
5  39.0  29  27.0  23.0  21.0  28.0

In [78]:
#droping the duplicate
df.drop_duplicates()   #based on the index

      a   b     c     d   e   f
0  12.0  16  26.0  21.0  12  20
1  39.0  19  17.0  33.0  30  10
2  26.0  21   NaN   NaN  31  25
3   NaN  10  34.0  30.0  29  36
4   NaN  37  13.0  24.0  20  37
5  39.0  29  27.0  23.0  21  28

In [79]:
#based on the perticular column
removing_duplicates=df.drop_duplicates("e")
removing_duplicates

      a   b     c     d   e   f
0  12.0  16  26.0  21.0  12  20
1  39.0  19  17.0  33.0  30  10
2  26.0  21   NaN   NaN  31  25
3   NaN  10  34.0  30.0  29  36
4   NaN  37  13.0  24.0  20  37
5  39.0  29  27.0  23.0  21  28

## Data transforming and mapping

In [80]:
 data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 
                               'Bacon','pastrami', 'honey ham', 'nova lox'],
                      'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [81]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [82]:
#suppose we want to add the column about meat from which animals
animals_meat={
    "bacon":"pig",
    "pulled pork":"pig",
    "pastrami":"cow",
    "corned beef":"cow",
    "honey ham":"cow",
    "nova lox":"cow"
}

In [83]:
#lets convert the all the value in lowercase using str.lower
lower_case=data["food"].str.lower()
lower_case

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [84]:
data["animals"]=lower_case.map(animals_meat)

In [85]:
data

          food  ounces animals
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     cow
8     nova lox     6.0     cow

In [86]:
#others method
data["a"]=data["food"].map(lambda x:animals_meat[x.lower()])

In [87]:
data=data.drop(["a"],axis=1)

In [88]:
data

          food  ounces animals
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     cow
8     nova lox     6.0     cow

## replacing the value

In [89]:
df

      a   b     c     d   e   f
0  12.0  16  26.0  21.0  12  20
1  39.0  19  17.0  33.0  30  10
2  26.0  21   NaN   NaN  31  25
3   NaN  10  34.0  30.0  29  36
4   NaN  37  13.0  24.0  20  37
5  39.0  29  27.0  23.0  21  28

In [90]:
df["a"].replace(np.nan,0,inplace=True)

In [91]:
data

          food  ounces animals
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     cow
8     nova lox     6.0     cow

In [92]:
data["food"]=data["food"].str.lower()
data

          food  ounces animals
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     cow
8     nova lox     6.0     cow

In [93]:
data["food"].replace("Bacon","bacon")

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [94]:
data["food"].replace({"Bacon":"bacon","Pastrami":"pastrami"})

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

## Discretization and Binning

In [95]:
df=pd.DataFrame({"name":list("abcdefghijk"),"age":[23,19,34,25,56,70,34,40,50,35,25]})
df

   name  age
0     a   23
1     b   19
2     c   34
3     d   25
4     e   56
5     f   70
6     g   34
7     h   40
8     i   50
9     j   35
10    k   25

In [96]:
bins=[18,30,45,60,100]
cats=pd.cut(df["age"],bins)
cats

0      (18, 30]
1      (18, 30]
2      (30, 45]
3      (18, 30]
4      (45, 60]
5     (60, 100]
6      (30, 45]
7      (30, 45]
8      (45, 60]
9      (30, 45]
10     (18, 30]
Name: age, dtype: category
Categories (4, interval[int64, right]): [(18, 30] < (30, 45] < (45, 60] < (60, 100]]

In [97]:
counts=pd.DataFrame(pd.value_counts(cats))
counts

           age
(18, 30]     4
(30, 45]     4
(45, 60]     2
(60, 100]    1

In [98]:
group_name=["adults","middle_age","senior","older"]

In [102]:
df["groups"]=pd.cut(df["age"],bins,labels=group_name)

In [103]:
df

   name  age      groups
0     a   23      adults
1     b   19      adults
2     c   34  middle_age
3     d   25      adults
4     e   56      senior
5     f   70       older
6     g   34  middle_age
7     h   40  middle_age
8     i   50      senior
9     j   35  middle_age
10    k   25      adults

In [104]:
rand=np.random.randn(100)

In [108]:
a=pd.cut(rand,4,precision=2)

In [109]:
a.value_counts()

(-2.62, -1.46]     9
(-1.46, -0.3]     28
(-0.3, 0.86]      39
(0.86, 2.02]      24
dtype: int64

In [110]:
rand=np.random.randn(100)

In [113]:
#quantile
quant=pd.qcut(rand,4)

In [114]:
quant.value_counts()

(-1.9449999999999998, -0.549]    25
(-0.549, 0.0268]                 25
(0.0268, 0.723]                  25
(0.723, 3.045]                   25
dtype: int64

##  detecting and filtering the outliers

In [118]:
rand_df=pd.DataFrame(np.random.randn(100,4))
rand_df.head()

          0         1         2         3
0  0.069978  0.349028  1.021296 -0.555868
1  0.648197 -0.030918 -0.189275 -1.922593
2 -1.756254 -0.333850  0.942841  0.897091
3  0.252496 -0.647604  0.034545  1.576614
4 -0.821849 -0.238331 -2.097379  0.781612

In [119]:
rand_df.describe()

                0           1           2           3
count  100.000000  100.000000  100.000000  100.000000
mean     0.051694   -0.179672   -0.141734    0.109632
std      0.901800    0.960880    0.921980    1.105381
min     -2.075390   -2.444389   -2.172189   -2.646204
25%     -0.617752   -0.723495   -0.848716   -0.696078
50%      0.094260   -0.086606   -0.247932    0.197622
75%      0.767766    0.349416    0.533504    0.830897
max      2.602361    2.915879    2.082655    2.567987

In [134]:
rand_df[np.abs(rand_df[2])>2][2]=0

C:\Users\Pratheek\AppData\Local\Temp\ipykernel_9656\718522823.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  rand_df[np.abs(rand_df[2])>2][2]=0

#### get_dummies  are used to convert the categorical variable into numeric

In [139]:
data1=pd.DataFrame({"key":["a","b","a","c","d","c","c"]})
data1

  key
0   a
1   b
2   a
3   c
4   d
5   c
6   c

In [143]:
data1=data1.join(pd.get_dummies(data1["key"]))
data1

  key  a  b  c  d
0   a  1  0  0  0
1   b  0  1  0  0
2   a  1  0  0  0
3   c  0  0  1  0
4   d  0  0  0  1
5   c  0  0  1  0
6   c  0  0  1  0

In [216]:
df=pd.read_csv("C:/Users/Pratheek/Desktop/project/archive/imdb_top_1000.csv")

In [205]:
movie=pd.DataFrame(df[["Series_Title","Released_Year","Genre"]])
movie.head(3)

               Series_Title Released_Year                 Genre
0  The Shawshank Redemption          1994                 Drama
1             The Godfather          1972          Crime, Drama
2           The Dark Knight          2008  Action, Crime, Drama

In [217]:
len(movie)

1000

In [255]:
all_genre=[]
for x in movie.Genre:
    all_genre.extend(x.split(","))

In [254]:
unique_genre=pd.unique(all_genre)
unique_genre

array(['Drama', 'Crime', ' Drama', 'Action', ' Crime', ' Adventure',
       'Biography', ' History', ' Sci-Fi', ' Romance', 'Western',
       ' Fantasy', 'Comedy', ' Thriller', 'Adventure', 'Animation',
       ' Family', ' War', ' Mystery', ' Music', ' Comedy', 'Horror',
       ' Biography', ' Action', ' Western', 'Mystery', ' Horror',
       ' Musical', ' Film-Noir', ' Sport', 'Film-Noir', 'Fantasy',
       'Family', 'Thriller'], dtype=object)

In [226]:
matrix=pd.DataFrame(np.zeros((len(movie), len(unique_genre))),columns=unique_genre)

In [227]:
for i,gen in enumerate(movie.Genre):
    ind=matrix.columns.get_indexer(gen.split(","))
    matrix.iloc[i,ind]=1

In [228]:
#practice
matrix.columns.get_indexer(movie.Genre[2].split(","))

array([3, 4, 2], dtype=int64)

In [229]:
matrix.head()

,Drama,Crime,Drama,Action,Crime,Adventure,Biography,History,Sci-Fi,Romance,...,Western,Mystery,Horror,Musical,Film-Noir,Sport,Film-Noir,Fantasy,Family,Thriller
0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [172]:
movie.join(matrix)

,Series_Title,Released_Year,Genre,Drama,Crime,Drama,Action,Crime,Adventure,Biography,...,Western,Mystery,Horror,Musical,Film-Noir,Sport,Film-Noir,Fantasy,Family,Thriller
0,The Shawshank Redemption,1994,Drama,1.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,The Godfather,1972,"Crime, Drama",0.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,The Dark Knight,2008,"Action, Crime, Drama",0.0,0.0,1.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,The Godfather: Part II,1974,"Crime, Drama",0.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,12 Angry Men,1957,"Crime, Drama",0.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
996,Giant,1956,"Drama, Western",1.0,0.0,0.0,0.0,0.0,0.0,0.0,...,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
997,From Here to Eternity,1953,"Drama, Romance, War",1.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
998,Lifeboat,1944,"Drama, War",1.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
999,The 39 Steps,1935,"Crime, Mystery, Thriller",0.0,1.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

## string method object

In [239]:
s1="nidhisha jain"
a=s1.split(" ")
a

['nidhisha', 'jain']

In [249]:
s2="nidhisha, jain"
pi=[x.strip() for x in s1.split(" ")]
pi

['nidhisha', 'jain']

In [250]:
a="nidhisha "
a.strip()

'nidhisha'

# Data Wrangling :

In [5]:
data=pd.Series(np.random.randint(20,50,12),index=[["a","a","a","a","b","b","b","c","c","c","d","d"],[1,2,3,4,1,2,3,1,2,3,1,2]])
data

a  1    40
   2    29
   3    36
   4    49
b  1    33
   2    33
   3    42
c  1    24
   2    25
   3    49
d  1    20
   2    36
dtype: int32

In [7]:
data["b"]

1    33
2    33
3    42
dtype: int32

In [8]:
data["b"][1]

33

In [14]:
data.loc[["a","c"]]

a  1    40
   2    29
   3    36
   4    49
c  1    24
   2    25
   3    49
dtype: int32

In [17]:
two_dem=data.unstack()
two_dem

      1     2     3     4
a  40.0  29.0  36.0  49.0
b  33.0  33.0  42.0   NaN
c  24.0  25.0  49.0   NaN
d  20.0  36.0   NaN   NaN

In [22]:
df_multi=pd.DataFrame(np.arange(16).reshape(4,4),
                      index=[["a","a","b","b"],[1,2,1,2]],
                      columns=[["aa","aa","bb","bb"],["red","green","red","green"]])

In [23]:
df_multi

     aa        bb
    red green red green
a 1   0     1   2     3
  2   4     5   6     7
b 1   8     9  10    11
  2  12    13  14    15

In [26]:
df_multi.index.names=["key1","key2"]

In [27]:
df_multi.columns.names=["country","state"]

In [28]:
df_multi

country    aa        bb
state     red green red green
key1 key2
a    1      0     1   2     3
     2      4     5   6     7
b    1      8     9  10    11
     2     12    13  14    15

In [31]:
df_multi.sum(level="key1")

C:\Users\Pratheek\AppData\Local\Temp\ipykernel_5200\1946567900.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  df_multi.sum(level="key1")

country  aa        bb
state   red green red green
key1
a         4     6   8    10
b        20    22  24    26

In [34]:
df_multi.sum(level="key2")

C:\Users\Pratheek\AppData\Local\Temp\ipykernel_5200\918045254.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  df_multi.sum(level="key2")

country  aa        bb
state   red green red green
key2
1         8    10  12    14
2        16    18  20    22

In [35]:
df_multi.sum(level="country",axis=1)

C:\Users\Pratheek\AppData\Local\Temp\ipykernel_5200\14993317.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  df_multi.sum(level="country",axis=1)

country    aa  bb
key1 key2
a    1      1   5
     2      9  13
b    1     17  21
     2     25  29

In [40]:
df=pd.DataFrame({"a":np.arange(8),"b":np.random.randint(10,40,8),
                "c":["a","a","b","b","b","c","c","c"],"d":[1,2,1,2,3,1,2,3]})
df

   a   b  c  d
0  0  24  a  1
1  1  22  a  2
2  2  36  b  1
3  3  35  b  2
4  4  28  b  3
5  5  36  c  1
6  6  30  c  2
7  7  11  c  3

In [42]:
set_ind=df.set_index(["c","d"])
set_ind

     a   b
c d
a 1  0  24
  2  1  22
b 1  2  36
  2  3  35
  3  4  28
c 1  5  36
  2  6  30
  3  7  11

In [43]:
df.set_index(["c","d"],drop=False)

     a   b  c  d
c d
a 1  0  24  a  1
  2  1  22  a  2
b 1  2  36  b  1
  2  3  35  b  2
  3  4  28  b  3
c 1  5  36  c  1
  2  6  30  c  2
  3  7  11  c  3

## Combining and merging the data set

In [3]:
df1=pd.DataFrame(np.random.randint(10,300,(10,4)),index=list("abcdefghij"),columns=["ind","uk","usa","ger"])
df2=pd.DataFrame(np.random.randint(20,50,(6,3)),index=list("ghijka"),columns=["pak","shri","nep"])

In [4]:
df1

   ind   uk  usa  ger
a   78  265   24  223
b   66   41  250  127
c  240  196  185  290
d  243   45  109  110
e  236   48  148  283
f  218  198  104   27
g   47  203   88   45
h   35  177  273  272
i  214  156  135  260
j   65  130   37  248

In [5]:
df2

   pak  shri  nep
g   29    41   41
h   23    45   35
i   22    46   47
j   46    27   29
k   42    37   24
a   32    43   23

In [6]:
df1.merge(df2,left_index=True,right_index=True)

   ind   uk  usa  ger  pak  shri  nep
a   78  265   24  223   32    43   23
g   47  203   88   45   29    41   41
h   35  177  273  272   23    45   35
i  214  156  135  260   22    46   47
j   65  130   37  248   46    27   29

In [7]:
df1.merge(df2,how="outer",left_index=True,right_index=True)

     ind     uk    usa    ger   pak  shri   nep
a   78.0  265.0   24.0  223.0  32.0  43.0  23.0
b   66.0   41.0  250.0  127.0   NaN   NaN   NaN
c  240.0  196.0  185.0  290.0   NaN   NaN   NaN
d  243.0   45.0  109.0  110.0   NaN   NaN   NaN
e  236.0   48.0  148.0  283.0   NaN   NaN   NaN
f  218.0  198.0  104.0   27.0   NaN   NaN   NaN
g   47.0  203.0   88.0   45.0  29.0  41.0  41.0
h   35.0  177.0  273.0  272.0  23.0  45.0  35.0
i  214.0  156.0  135.0  260.0  22.0  46.0  47.0
j   65.0  130.0   37.0  248.0  46.0  27.0  29.0
k    NaN    NaN    NaN    NaN  42.0  37.0  24.0

In [8]:
df3=pd.DataFrame({"lkey":["a","a","c","d","e",'c',"h"],
                "data1":range(7)})
df4=pd.DataFrame({"rkey":["a","c","d"],
                "data2":range(3)})

In [9]:
pd.merge(df3,df4,left_on="lkey",right_on="rkey",how="inner")

  lkey  data1 rkey  data2
0    a      0    a      0
1    a      1    a      0
2    c      2    c      1
3    c      5    c      1
4    d      3    d      2

In [10]:
df5=pd.DataFrame({"id":["a","b","c","d"],
                "country":["ind","shri","pak","ger"]})

In [11]:
df6=pd.DataFrame({"id":["c","d","e","f"],
                 "country":["ind",'jan',"pak","uk"]})

In [84]:
pd.merge(df5,df6,right_on="id",left_on="id",how="inner")

  id country_x country_y
0  c       pak       ind
1  d       ger       jan

In [13]:
pd.merge(df5,df6,on=["id"],how="left")

  id country_x country_y
0  a       ind       NaN
1  b      shri       NaN
2  c       pak       ind
3  d       ger       jan

In [14]:
pd.merge(df5,df6,on=["id"],how="left",suffixes=("_claas_a","_class_b"))

  id country_claas_a country_class_b
0  a             ind             NaN
1  b            shri             NaN
2  c             pak             ind
3  d             ger             jan

In [20]:
df5

  id country
0  a     ind
1  b    shri
2  c     pak
3  d     ger

In [21]:
df6

  id country
0  c     ind
1  d     jan
2  e     pak
3  f      uk

In [24]:
  pd.merge(df5,df6,left_on="id",right_on="id",how="left")

  id country_x country_y
0  a       ind       NaN
1  b      shri       NaN
2  c       pak       ind
3  d       ger       jan

In [30]:
df7=pd.DataFrame({"id":np.arange(6),
                 "d1":["nidhi","niks","nive","sana","adi","pathu"]})
df8=pd.DataFrame({"d2":["geetha","sam","sharu"]},index=[2,4,9])

In [31]:
df7

   id     d1
0   0  nidhi
1   1   niks
2   2   nive
3   3   sana
4   4    adi
5   5  pathu

In [32]:
df8

       d2
2  geetha
4     sam
9   sharu

In [33]:
pd.merge(df7,df8,left_on="id",right_index=True)

   id    d1      d2
2   2  nive  geetha
4   4   adi     sam

In [34]:
pd.merge(df8,df7,right_on="id",left_index=True)

       d2  id    d1
2  geetha   2  nive
4     sam   4   adi

In [36]:
pd.merge(df7,df8,how="right",left_on="id",right_index=True)

     id    d1      d2
2.0   2  nive  geetha
4.0   4   adi     sam
NaN   9   NaN   sharu

### concatenateing along an axis

In [47]:
s1=pd.Series(["nidhi","niks","nive"],index=list("abc"))
s2=pd.Series(["sana","geetha"],index=list("df"))
s3=pd.Series(["sharu","veena"],index=list("gh"))

In [48]:
s1

a    nidhi
b     niks
c     nive
dtype: object

In [49]:
s2

d      sana
f    geetha
dtype: object

In [50]:
s3

g    sharu
h    veena
dtype: object

In [51]:
pd.concat([s1,s2,s3])

a     nidhi
b      niks
c      nive
d      sana
f    geetha
g     sharu
h     veena
dtype: object

In [52]:
pd.concat([s1,s2,s3],axis=1)

       0       1      2
a  nidhi     NaN    NaN
b   niks     NaN    NaN
c   nive     NaN    NaN
d    NaN    sana    NaN
f    NaN  geetha    NaN
g    NaN     NaN  sharu
h    NaN     NaN  veena

In [55]:
s4=pd.concat([s1,s2])
s4

a     nidhi
b      niks
c      nive
d      sana
f    geetha
dtype: object

In [56]:
pd.concat([s1,s4])

a     nidhi
b      niks
c      nive
a     nidhi
b      niks
c      nive
d      sana
f    geetha
dtype: object

In [57]:
pd.concat([s1,s4],axis=1)

       0       1
a  nidhi   nidhi
b   niks    niks
c   nive    nive
d    NaN    sana
f    NaN  geetha

In [65]:
pd.concat([s4,s1],join="inner",axis=0)

a     nidhi
b      niks
c      nive
d      sana
f    geetha
a     nidhi
b      niks
c      nive
dtype: object

In [66]:
pd.concat([s4,s1],join="inner",axis=1)

       0      1
a  nidhi  nidhi
b   niks   niks
c   nive   nive

In [72]:
h1=pd.concat([s1,s2,s3],keys=["one","two","three"])

In [73]:
h1.unstack()

           a     b     c     d       f      g      h
one    nidhi  niks  nive   NaN     NaN    NaN    NaN
two      NaN   NaN   NaN  sana  geetha    NaN    NaN
three    NaN   NaN   NaN   NaN     NaN  sharu  veena

In [74]:
df1=pd.DataFrame(np.arange(12).reshape(4,3),
                index=list("abcd"),
                columns=["one","two","three"])
df2=pd.DataFrame(np.arange(15).reshape(5,3),
                index=list("cdefg"),
                columns=["one","two","three"])
df3=pd.DataFrame(np.arange(16).reshape(4,4),
                index=list("abeh"),
                columns=["one","two","three","four"])

In [75]:
df1

   one  two  three
a    0    1      2
b    3    4      5
c    6    7      8
d    9   10     11

In [76]:
df2

   one  two  three
c    0    1      2
d    3    4      5
e    6    7      8
f    9   10     11
g   12   13     14

In [77]:
df3

   one  two  three  four
a    0    1      2     3
b    4    5      6     7
e    8    9     10    11
h   12   13     14    15

In [78]:
pd.concat([df1,df2])

   one  two  three
a    0    1      2
b    3    4      5
c    6    7      8
d    9   10     11
c    0    1      2
d    3    4      5
e    6    7      8
f    9   10     11
g   12   13     14

In [79]:
pd.concat([df1,df2],axis=1)

   one   two  three   one   two  three
a  0.0   1.0    2.0   NaN   NaN    NaN
b  3.0   4.0    5.0   NaN   NaN    NaN
c  6.0   7.0    8.0   0.0   1.0    2.0
d  9.0  10.0   11.0   3.0   4.0    5.0
e  NaN   NaN    NaN   6.0   7.0    8.0
f  NaN   NaN    NaN   9.0  10.0   11.0
g  NaN   NaN    NaN  12.0  13.0   14.0

In [80]:
pd.concat([df1,df2],axis=1,join="inner")

   one  two  three  one  two  three
c    6    7      8    0    1      2
d    9   10     11    3    4      5

In [82]:
pd.concat([df1,df2],ignore_index=True)

   one  two  three
0    0    1      2
1    3    4      5
2    6    7      8
3    9   10     11
4    0    1      2
5    3    4      5
6    6    7      8
7    9   10     11
8   12   13     14

In [87]:
df1

   one  two  three
a    0    1      2
b    3    4      5
c    6    7      8
d    9   10     11

In [93]:
df1.iloc[-3:,1]

b     4
c     7
d    10
Name: two, dtype: int32

In [98]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],index=['f', 'e', 'd', 'c', 'b', 'a'])
b = pd.Series(np.arange(len(a), dtype=np.float64),index=['f', 'e', 'd', 'c', 'b', 'a'])
b[-1]=np.nan

In [99]:
a               # nan.3.5,4.5,nan

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [100]:
b                 #0.0,1.0,2.0,3.0

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [101]:
b.combine_first(a)

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [102]:
a.combine_first(b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    NaN
dtype: float64

In [104]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

###  Reshaping and pivoting

stack
<br>
This “rotates” or pivots from the columns in the data to the rows
<br>
unstack
<br>
This pivots from the rows into the columns